{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": {
      "Fixed": 512
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<pad>": 0,
      "</s>": 1,
      "<unk>": 2,
      "ฉัน": 3,
      "พ่อ": 4,
      "ทำอาหาร": 5,
      "รัก": 6,
      "เท่าไร": 7,
      "แม่": 8,
      "ชอบ": 9,
      "ราคา": 10,
      "ร้อน": 11,
      "หมา": 12,
      "อากาศ": 13,
      "แมว": 14,
      "กิน": 15,
      "ทำ": 16,
      "นอน": 17,
      "ฝนตก": 18,
      "พรุ่งนี้": 19,
      "วันนี้": 20,
      "อร่อย": 21,
      "เพื่อน": 22,
      "เรียนหนังสือ": 23,
      "เห็น": 24,
      "คุณ": 25,
      "ดีใจ": 26,
      "ตำรวจ": 27,
      "ทหาร": 28,
      "ผักกาด": 29,
      "พบกัน": 30,
      "ร้องไห้": 31,
      "สบายดี": 32,
      "หนาว": 33,
      "หิว": 34,
      "อายุ": 35,
      "เครียด": 36,
      "เมื่อวาน": 37,
      "เย็น": 38,
      "เศร้า": 39,
      "เสียใจ": 40,
      "แตงกวา": 41,
      "โกรธ": 42,
      "ใหม่": 43
    },
    "unk_token": "<unk>"
  }
}