{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": {
      "Fixed": 512
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          1
        ],
        "tokens": [
          "</s>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "อ",
        -3.3010500069636706
      ],
      [
        "ว",
        -3.319126416724047
      ],
      [
        "ด",
        -3.4100355305253394
      ],
      [
        "เ",
        -3.4796295381112765
      ],
      [
        "า",
        -3.586462272568533
      ],
      [
        "ส",
        -3.746102657473048
      ],
      [
        "ร่",
        -3.8994068030430964
      ],
      [
        "ก",
        -4.031065510040365
      ],
      [
        "็",
        -4.055655238111782
      ],
      [
        "อย",
        -4.057424390430643
      ],
      [
        "ห",
        -4.111285445526082
      ],
      [
        "หม",
        -4.118406373432327
      ],
      [
        "ฉัน",
        -4.192303012318268
      ],
      [
        "ร",
        -4.238288136726144
      ],
      [
        "่",
        -4.241315924910928
      ],
      [
        "ใ",
        -4.255670489711633
      ],
      [
        "ทำอาหาร",
        -4.2556723800432135
      ],
      [
        "เท่าไ",
        -4.255673038178896
      ],
      [
        "น",
        -4.40633276207628
      ],
      [
        "จ",
        -4.4683639733973335
      ],
      [
        "้",
        -4.473658675077311
      ],
      [
        "แม",
        -4.4860623861997
      ],
      [
        "ท",
        -4.495470959756801
      ],
      [
        "ัง",
        -4.505670508398926
      ],
      [
        "พ่อของฉัน",
        -4.505670534105401
      ],
      [
        "ดี",
        -4.505670604490829
      ],
      [
        "แม่ของฉัน",
        -4.505671177277818
      ],
      [
        "ราคา",
        -4.505680228085597
      ],
      [
        "รีย",
        -4.507099505989187
      ],
      [
        "หน",
        -4.571238739604643
      ],
      [
        "ื",
        -4.818378439351691
      ],
      [
        "ต",
        -4.823543413172892
      ],
      [
        "ำ",
        -4.8248433029126465
      ],
      [
        "บ",
        -4.838657190207293
      ],
      [
        "ค",
        -4.838990272389589
      ],
      [
        "ฝ",
        -4.839003823005007
      ],
      [
        "คุณ",
        -4.839003823005008
      ],
      [
        "โ",
        -4.839003823044967
      ],
      [
        "ู",
        -4.839003823044967
      ],
      [
        "กิน",
        -4.839172904953183
      ],
      [
        "นอน",
        -4.839970949547608
      ],
      [
        "้า",
        -4.8513925179702655
      ],
      [
        "นต",
        -4.854704075984589
      ],
      [
        "นหน",
        -4.858814958090767
      ],
      [
        "ฉันเ",
        -4.904063267144856
      ],
      [
        "ง",
        -5.255523719543069
      ],
      [
        "ไ",
        -5.276719238722066
      ],
      [
        "ข",
        -5.2791483019571
      ],
      [
        "ชอบ",
        -5.314901032898463
      ],
      [
        "ร้อ",
        -5.325844421036868
      ],
      [
        "สิบ",
        -5.332001384130455
      ],
      [
        "พรุ่งนี้",
        -5.336641681660449
      ],
      [
        "ิ",
        -5.338514602954191
      ],
      [
        "ช",
        -5.338650974982483
      ],
      [
        "เมื่อวาน",
        -5.339003823005009
      ],
      [
        " ",
        -5.339003823005015
      ],
      [
        "ยี่สิบ",
        -5.339003823005395
      ],
      [
        "ึ",
        -5.339003823044967
      ],
      [
        "ะ",
        -5.339003823044967
      ],
      [
        "ล",
        -5.339003823044967
      ],
      [
        "ผักกาด",
        -5.339003823044967
      ],
      [
        "แตงกวา",
        -5.339003823401262
      ],
      [
        "อายุ",
        -5.339003823542683
      ],
      [
        "กัน",
        -5.339003825257777
      ],
      [
        "เพื่อนของฉันรัก",
        -5.339003897394508
      ],
      [
        "พ่อของฉันเป็น",
        -5.339005207321311
      ],
      [
        "วันนี้อากาศ",
        -5.339877152490956
      ],
      [
        "หาร",
        -5.341149928453554
      ],
      [
        "สี่สิบ",
        -5.341360334375925
      ],
      [
        "พรุ่งนี้อากาศ",
        -5.341371397928707
      ],
      [
        "สามสิบ",
        -5.341387713831612
      ],
      [
        "ห้าสิบ",
        -5.34151148834246
      ],
      [
        "ไม่",
        -5.341860322265498
      ],
      [
        "ฉันรัก",
        -5.346124464448076
      ],
      [
        "ฉันเห็น",
        -5.346345559661547
      ],
      [
        "ฉันร้อ",
        -5.354572097932326
      ],
      [
        "ทำ",
        -5.362552477378291
      ],
      [
        "ขอ",
        -5.402552682935983
      ],
      [
        "เจ",
        -5.429200425017533
      ],
      [
        "ฉันห",
        -6.206335810706825
      ],
      [
        "เห็น",
        -6.320630743816292
      ],
      [
        "รัก",
        -6.321048886967441
      ],
      [
        "ีย",
        -6.330757980193925
      ],
      [
        "อากาศ",
        -6.330775811852611
      ],
      [
        "สาม",
        -6.332946985400148
      ],
      [
        "สี่",
        -6.333016275007516
      ],
      [
        "แ",
        -6.336079610399441
      ],
      [
        "วันนี้",
        -6.336779500302792
      ],
      [
        "พ",
        -6.338248999503433
      ],
      [
        "ป",
        -6.33900029229033
      ],
      [
        "เพื่อน",
        -6.339003680114457
      ],
      [
        "ษ",
        -6.339003823044967
      ],
      [
        "ถ",
        -6.339003823044967
      ],
      [
        "ธ",
        -6.339003823044967
      ],
      [
        "ศร้",
        -6.339003943358235
      ],
      [
        "วั",
        -6.339004984042749
      ],
      [
        "พ่อ",
        -6.339755315464361
      ],
      [
        "าย",
        -6.359687859557157
      ],
      [
        "่ง",
        -6.401652333115084
      ],
      [
        "ฉันชอบ",
        -6.403937265740294
      ],
      [
        "ื่",
        -6.429305328803554
      ],
      [
        "แม่",
        -6.463261299258249
      ],
      [
        "ห้า",
        -6.471691095183164
      ],
      [
        "ไห",
        -6.507381524546034
      ],
      [
        "อง",
        -6.5124704538792635
      ],
      [
        "ฉันก",
        -6.590018985818565
      ],
      [
        "ย",
        -6.666065138649483
      ],
      [
        "ฉ",
        -6.6661651386494825
      ],
      [
        "ั",
        -6.666265138649482
      ],
      [
        "ผ",
        -6.666365138649483
      ],
      [
        "ม",
        -6.666465138649483
      ],
      [
        "ุ",
        -6.666565138649482
      ],
      [
        "ศ",
        -6.666665138649482
      ],
      [
        "ณ",
        -6.666765138649483
      ],
      [
        "ี",
        -6.666865138649483
      ],
      [
        "่า",
        -6.666865138649483
      ]
    ],
    "byte_fallback": false
  }
}